# MoveNext Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSetIterator..::..MoveNext Method
ElectricalSystemSetIterator Class See Also
---
Move the iterator one item forward.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Return Value
Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the set.
# ### Implements
IEnumerator..::..MoveNext()()()()
# Remarks
MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.
# See Also
ElectricalSystemSetIterator Class
Autodesk.Revit.DB.Electrical Namespace